# AirFlow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..AirFlow Property
SpecTypeId Class See Also
---
Air Flow, in discipline HVAC.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId AirFlow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AirFlow As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AirFlow {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace